[
    {
        "id": 1,
        "name": "Tebra",
        "link": "https://www.tebra.com/",
        "technologies": ["WordPress", "Sass", "Foundation"],
        "image": "/projects/tebra.png",
        "workDone": "Jump in project in the middle of the change of brand and helped with the creation of a custom form creator able to set the required, the not required, hidden. Also helped with the creation of multiple components.",
        "github": "",
        "description": "Tebra provide independent healthcare practices with digital tools and support to thrive in a new era of healthcare."
    },
    {
        "id": 2,
        "name": "Priio",
        "link": "https://priio.com/",
        "technologies": ["Vue", "Node.js", "Laravel", "WordPress", "Sass"],
        "image": "/projects/priio.png",
        "workDone": "Started in this project with the legacy code of the first iteration, reskin the whole project with vue for the app and Laravel for the Backend, also worked on the sales website made with WordPress.",
        "github": "",
        "description": "Priio will deliver fast results ranked in order of what you and your team need to prioritize in order to gain maximum clarity and ultimately succeed."
    },
    {
        "id": 4,
        "name": "BAM",
        "link": "https://app.bam.butchershop.dev/",
        "technologies": ["React", "Next", "Strapi", "Foundation", "Sass"],
        "image": "/projects/BAM.gif",
        "workDone": "Led the development team, chose the technologies implemented. Worked closely with the design team to create components that are easilty recycle between iterations.",
        "github": "",
        "description": "Product created by Butchershop, to help the client with their Brand Assets thus the name BAM (Brand Asset Manager). Multiple iterations for varios clients such as: TAE, Arctic Adventures, One Trust and most recently AppFire."
    },
    {
        "id": 3,
        "name": "RockCreek Group",
        "link": "https://therockcreekgroup.com/",
        "technologies": ["WordPress", "Algolia", "Sass", "Foundation"],
        "image": "/projects/rockcreekgroup.gif",
        "workDone": "This was my first led project and I supervised the whole development process and personally added algolia to the project.",
        "github": "",
        "description": "A Global Investment Firm Helping Shape a More Sustainable Tomorrow."
    },
    {
        "id": 5,
        "name": "Fernando Barraza Quintero Portfolio",
        "link": "https://febaqui.netlify.app/",
        "technologies": ["Vue", "Tailwind"],
        "image": "/projects/fernandobq.png",
        "workDone": "I created this site to showcase the technologies and abilities to code that I have honed throught my career, credit to Guillermo Gonzalez for helping me with the design.",
        "github": "https://github.com/fernandobq/portfolio",
        "description": "My portfolio."
    },
    {
        "id": 6,
        "name": "Grail",
        "link": "https://grail.com/",
        "technologies": ["WordPress", "Foundation", "Sass"],
        "image": "/projects/grail.png",
        "workDone": "Created the articles and publications structure for the blog post of the site, and also created a vast of components used in the site.",
        "github": "https://github.com/fernandobq/portfolio",
        "description": "Healthcare company focused on saving lives and improving health by pioneering new technologies for early cancer detection."
    }
]
